let countryCodeTemp = [
    {
        string: [
            "亚洲",
            "中国",
        ],
        id: "86",
        key: "214"
    },
    {
        string: [
            "亚洲",
            "中国台湾",
        ],
        id: "886"
        , key: "214"
    },
    {
        string: [
            "亚洲",
            "中国香港",
        ],
        id: "852"
        , key: "214"
    }, {
        string: [
            "亚洲",
            "中国澳门",
        ],
        id: "853"
        , key: "214"
    },
    {
        string: [
            "欧洲",
            "阿尔巴尼亚",
        ],
        id: "355"
        , key: "289"
    },
    {
        string: [
            "非洲",
            "阿尔及利亚",
        ],
        id: "213"
        , key: "339"
    },
    {
        string: [
            "亚洲",
            "阿富汗",
        ],
        id: "93"
        , key: "231"
    },
    {
        string: [
            "南美洲",
            "阿根廷",
        ],
        id: "54"
        , key: "312"
    },
    {
        string: [
            "北美洲",
            "阿拉斯加",
        ],
        id: "1907"
        , key: "416"
    },
    {
        string: [
            "亚洲",
            "阿联酋",
        ],
        id: "971"
        , key: "252"
    },
    {
        string: [
            "非洲",
            "阿鲁巴岛",
        ],
        id: "297"
        , key: "393"
    },
    {
        string: [
            "亚洲",
            "阿曼",
        ],
        id: "968"
        , key: "250"
    },
    {
        string: [
            "亚洲",
            "阿塞拜疆",
        ],
        id: "994"
        , key: "260"
    },
    {
        string: [
            "非洲",
            "阿森松",
        ],
        id: "247"
        , key: "369"
    },
    {
        string: [
            "非洲",
            "埃及",
        ],
        id: "20"
        , key: "336"
    },
    {
        string: [
            "非洲",
            "埃塞俄比亚",
        ],
        id: "251"
        , key: "373"
    },
    {
        string: [
            "欧洲",
            "爱尔兰",
        ],
        id: "353"
        , key: "287"
    },
    {
        string: [
            "欧洲",
            "爱沙尼亚",
        ],
        id: "372"
        , key: "296"
    },
    {
        string: [
            "欧洲",
            "安道尔共和国",
        ],
        id: "376"
        , key: "298"
    },
    {
        string: [
            "非洲",
            "安哥拉",
        ],
        id: "244"
        , key: "367"
    },
    {
        string: [
            "北美洲",
            "安圭拉岛",
        ],
        id: "1-264"
        , key: "423"
    },
    {
        string: [
            "欧洲",
            "奥地利",
        ],
        id: "43"
        , key: "276"
    },
    {
        string: [
            "大洋洲",
            "澳大利亚",
        ],
        id: "61"
        , key: "396"
    },

    {
        string: [
            "北美洲",
            "巴巴多斯",
        ],
        id: "1246"
        , key: "425"
    },
    {
        string: [
            "北美洲",
            "巴哈马",
        ],
        id: "1809"
        , key: "422"
    },
    {
        string: [
            "亚洲",
            "巴基斯坦",
        ],
        id: "92"
        , key: "230"
    },
    {
        string: [
            "南美洲",
            "巴拉圭",
        ],
        id: "595"
        , key: "332"
    },
    {
        string: [
            "亚洲",
            "巴勒斯坦",
        ],
        id: "970"
        , key: "251"
    },
    {
        string: [
            "亚洲",
            "巴林",
        ],
        id: "973"
        , key: "254"
    },
    {
        string: [
            "南美洲",
            "巴拿马",
        ],
        id: "507"
        , key: "324"
    },
    {
        string: [
            "南美洲",
            "巴西",
        ],
        id: "55"
        , key: "313"
    },
    {
        string: [
            "欧洲",
            "保加利亚",
        ],
        id: "359"
        , key: "293"
    },
    {
        string: [
            "非洲",
            "贝宁",
        ],
        id: "229"
        , key: "351"
    },
    {
        string: [
            "欧洲",
            "比利时",
        ],
        id: "32"
        , key: "271"
    },
    {
        string: [
            "欧洲",
            "冰岛",
        ],
        id: "354"
        , key: "288"
    },
    {
        string: [
            "北美洲",
            "波多黎各",
        ],
        id: "1-939"
        , key: "421"
    },
    {
        string: [
            "欧洲",
            "波黑",
        ],
        id: "387"
        , key: "303"
    },
    {
        string: [
            "欧洲",
            "波兰",
        ],
        id: "48"
        , key: "280"
    },
    {
        string: [
            "南美洲",
            "玻利维亚",
        ],
        id: "591"
        , key: "328"
    },
    {
        string: [
            "南美洲",
            "伯利兹",
        ],
        id: "501"
        , key: "318"
    },
    {
        string: [
            "非洲",
            "博茨瓦纳",
        ],
        id: "267"
        , key: "388"
    },
    {
        string: [
            "亚洲",
            "不丹",
        ],
        id: "975"
        , key: "256"
    },
    {
        string: [
            "非洲",
            "布基拉法索",
        ],
        id: "226"
        , key: "348"
    },
    {
        string: [
            "非洲",
            "布隆迪",
        ],
        id: "257"
        , key: "379"
    }
    ,
    {
        string: [
            "亚洲",
            "朝鲜",
        ],
        id: "850"
        , key: "238"
    },
    {
        string: [
            "非洲",
            "赤道几内亚",
        ],
        id: "240"
        , key: "363"
    }
    ,
    {
        string: [
            "欧洲",
            "丹麦",
        ],
        id: "45"
        , key: "277"
    },
    {
        string: [
            "欧洲",
            "德国",
        ],
        id: "49"
        , key: "265"
    },
    {
        string: [
            "亚洲",
            "东帝汶",
        ],
        id: "670"
        , key: "236"
    },
    {
        string: [
            "大洋洲",
            "东萨摩亚",
        ],
        id: "684"
        , key: "406"
    },
    {
        string: [
            "非洲",
            "多哥",
        ],
        id: "228"
        , key: "350"
    }
    ,
    {
        string: [
            "欧洲",
            "俄罗斯",
        ],
        id: "007"
        , key: "268"
    },
    {
        string: [
            "南美洲",
            "厄瓜多尔",
        ],
        id: "593"
        , key: "330"
    },
    {
        string: [
            "非洲",
            "厄立特里亚",
        ],
        id: "291"
        , key: "392"
    }
    ,
    {
        string: [
            "欧洲",
            "法国",
        ],
        id: "33"
        , key: "267"
    },
    {
        string: [
            "非洲",
            "法罗群岛",
        ],
        id: "298"
        , key: "394"
    },
    {
        string: [
            "南美洲",
            "法属圭亚那",
        ],
        id: "594"
        , key: "331"
    },
    {
        string: [
            "欧洲",
            "梵蒂冈",
        ],
        id: "396"
        , key: "305"
    },
    {
        string: [
            "亚洲",
            "菲律宾",
        ],
        id: "63"
        , key: "220"
    },
    {
        string: [
            "大洋洲",
            "斐济",
        ],
        id: "679"
        , key: "403"
    },
    {
        string: [
            "欧洲",
            "芬兰",
        ],
        id: "358"
        , key: "292"
    },
    {
        string: [
            "非洲",
            "佛得角",
        ],
        id: "238"
        , key: "360"
    },
    {
        string: [
            "南美洲",
            "福克兰群岛",
        ],
        id: "500"
        , key: "317"
    }
    ,
    {
        string: [
            "非洲",
            "冈比亚",
        ],
        id: "220"
        , key: "342"
    },
    {
        string: [
            "非洲",
            "刚果",
        ],
        id: "242"
        , key: "365"
    },
    {
        string: [
            "南美洲",
            "哥伦比亚",
        ],
        id: "57"
        , key: "315"
    },
    {
        string: [
            "南美洲",
            "哥斯达黎加",
        ],
        id: "506"
        , key: "323"
    },
    {
        string: [
            "北美洲",
            "格陵兰岛",
        ],
        id: "299"
        , key: "417"
    },
    {
        string: [
            "南美洲",
            "古巴",
        ],
        id: "53"
        , key: "311"
    },
    {
        string: [
            "南美洲",
            "瓜德罗普",
        ],
        id: "590"
        , key: "327"
    },
    {
        string: [
            "大洋洲",
            "关岛",
        ],
        id: "671"
        , key: "398"
    },
    {
        string: [
            "南美洲",
            "圭亚那",
        ],
        id: "592"
        , key: "329"
    }
    ,
    {
        string: [
            "亚洲",
            "哈萨克斯坦",
        ],
        id: "7"
        , key: "226"
    },
    {
        string: [
            "南美洲",
            "海地",
        ],
        id: "509"
        , key: "326"
    },
    {
        string: [
            "亚洲",
            "韩国",
        ],
        id: "82"
        , key: "224"
    },
    {
        string: [
            "欧洲",
            "荷兰",
        ],
        id: "31"
        , key: "270"
    },
    {
        string: [
            "南美洲",
            "洪都拉斯",
        ],
        id: "504"
        , key: "321"
    }
    ,
    {
        string: [
            "大洋洲",
            "基里巴斯",
        ],
        id: "686"
        , key: "408"
    },
    {
        string: [
            "非洲",
            "吉布提",
        ],
        id: "253"
        , key: "375"
    },
    {
        string: [
            "亚洲",
            "吉尔吉斯斯坦",
        ],
        id: "996"
        , key: "262"
    },
    {
        string: [
            "非洲",
            "几内亚",
        ],
        id: "224"
        , key: "346"
    },
    {
        string: [
            "非洲",
            "几内亚比绍",
        ],
        id: "245"
        , key: "368"
    },
    {
        string: [
            "北美洲",
            "加拿大",
        ],
        id: "001"
        , key: "414"
    },
    {
        string: [
            "非洲",
            "加纳",
        ],
        id: "233"
        , key: "355"
    },
    {
        string: [
            "非洲",
            "加蓬",
        ],
        id: "241"
        , key: "364"
    },
    {
        string: [
            "亚洲",
            "柬埔寨",
        ],
        id: "855"
        , key: "239"
    },
    {
        string: [
            "欧洲",
            "捷克",
        ],
        id: "420"
        , key: "306"
    },
    {
        string: [
            "非洲",
            "津巴布韦",
        ],
        id: "263"
        , key: "384"
    }
    ,
    {
        string: [
            "非洲",
            "喀麦隆",
        ],
        id: "237"
        , key: "359"
    },
    {
        string: [
            "亚洲",
            "卡塔尔",
        ],
        id: "974"
        , key: "255"
    },
    {
        string: [
            "大洋洲",
            "科科斯岛",
        ],
        id: "619162"
        , key: "410"
    },
    {
        string: [
            "大洋洲",
            "科克群岛",
        ],
        id: "682"
        , key: "404"
    },
    {
        string: [
            "非洲",
            "科摩罗",
        ],
        id: "269"
        , key: "390"
    },
    {
        string: [
            "非洲",
            "科特迪瓦",
        ],
        id: "225"
        , key: "347"
    },
    {
        string: [
            "亚洲",
            "科威特",
        ],
        id: "965"
        , key: "247"
    },
    {
        string: [
            "欧洲",
            "克罗地亚",
        ],
        id: "385"
        , key: "301"
    },
    {
        string: [
            "非洲",
            "肯尼亚",
        ],
        id: "254"
        , key: "376"
    }
    ,
    {
        string: [
            "欧洲",
            "拉脱维亚",
        ],
        id: "371"
        , key: "295"
    },
    {
        string: [
            "非洲",
            "莱索托",
        ],
        id: "266"
        , key: "387"
    },
    {
        string: [
            "亚洲",
            "老挝",
        ],
        id: "856"
        , key: "240"
    },
    {
        string: [
            "亚洲",
            "黎巴嫩",
        ],
        id: "961"
        , key: "243"
    },
    {
        string: [
            "欧洲",
            "立陶宛",
        ],
        id: "370"
        , key: "294"
    },
    {
        string: [
            "非洲",
            "利比里亚",
        ],
        id: "231"
        , key: "353"
    },
    {
        string: [
            "非洲",
            "利比亚",
        ],
        id: "218"
        , key: "341"
    },
    {
        string: [
            "欧洲",
            "列支敦士登",
        ],
        id: "423"
        , key: "308"
    },
    {
        string: [
            "非洲",
            "留尼旺岛",
        ],
        id: "262"
        , key: "383"
    },
    {
        string: [
            "欧洲",
            "卢森堡",
        ],
        id: "352"
        , key: "286"
    },
    {
        string: [
            "非洲",
            "卢旺达",
        ],
        id: "250"
        , key: "372"
    },
    {
        string: [
            "欧洲",
            "罗马尼亚",
        ],
        id: "40"
        , key: "274"
    }
    ,
    {
        string: [
            "非洲",
            "马达加斯加",
        ],
        id: "261"
        , key: "382"
    },
    {
        string: [
            "亚洲",
            "马尔代夫",
        ],
        id: "960"
        , key: "242"
    },
    {
        string: [
            "欧洲",
            "马耳他",
        ],
        id: "356"
        , key: "290"
    },
    {
        string: [
            "非洲",
            "马拉维",
        ],
        id: "265"
        , key: "386"
    },
    {
        string: [
            "亚洲",
            "马来西亚",
        ],
        id: "60"
        , key: "218"
    },
    {
        string: [
            "非洲",
            "马里",
        ],
        id: "223"
        , key: "345"
    },
    {
        string: [
            "欧洲",
            "马其顿",
        ],
        id: "389"
        , key: "304"
    },
    {
        string: [
            "南美洲",
            "马提尼克",
        ],
        id: "596"
        , key: "333"
    },
    {
        string: [
            "非洲",
            "毛里求斯",
        ],
        id: "230"
        , key: "352"
    },
    {
        string: [
            "非洲",
            "毛里塔尼亚",
        ],
        id: "222"
        , key: "344"
    },
    {
        string: [
            "北美洲",
            "美国",
        ],
        id: "1"
        , key: "413"
    },
    {
        string: [
            "亚洲",
            "蒙古",
        ],
        id: "976"
        , key: "257"
    },
    {
        string: [
            "亚洲",
            "孟加拉国",
        ],
        id: "880"
        , key: "241"
    },
    {
        string: [
            "南美洲",
            "秘鲁",
        ],
        id: "51"
        , key: "309"
    },
    {
        string: [
            "亚洲",
            "缅甸",
        ],
        id: "95"
        , key: "233"
    },
    {
        string: [
            "欧洲",
            "摩尔多瓦",
        ],
        id: "373"
        , key: "297"
    },
    {
        string: [
            "非洲",
            "摩洛哥",
        ],
        id: "212"
        , key: "338"
    },
    {
        string: [
            "非洲",
            "摩纳哥",
        ],
        id: "377"
        , key: "395"
    },
    {
        string: [
            "非洲",
            "莫桑比克",
        ],
        id: "258"
        , key: "380"
    },
    {
        string: [
            "南美洲",
            "墨西哥",
        ],
        id: "52"
        , key: "310"
    }
    ,
    {
        string: [
            "非洲",
            "纳米比亚",
        ],
        id: "264"
        , key: "385"
    },
    {
        string: [
            "非洲",
            "南非",
        ],
        id: "27"
        , key: "337"
    },
    {
        string: [
            "南极洲",
            "南极洲",
        ],
        id: "64672"
        , key: "427"
    },
    {
        string: [
            "欧洲",
            "南斯拉夫",
        ],
        id: "338"
        , key: "283"
    },
    {
        string: [
            "欧洲",
            "南斯拉夫",
        ],
        id: "381"
        , key: "300"
    },
    {
        string: [
            "大洋洲",
            "瑙鲁",
        ],
        id: "674"
        , key: "399"
    },
    {
        string: [
            "亚洲",
            "尼泊尔",
        ],
        id: "977"
        , key: "258"
    },
    {
        string: [
            "南美洲",
            "尼加拉瓜",
        ],
        id: "505"
        , key: "322"
    },
    {
        string: [
            "非洲",
            "尼日尔",
        ],
        id: "227"
        , key: "349"
    },
    {
        string: [
            "非洲",
            "尼日利亚",
        ],
        id: "234"
        , key: "356"
    },
    {
        string: [
            "大洋洲",
            "纽埃岛",
        ],
        id: "683"
        , key: "405"
    },
    {
        string: [
            "欧洲",
            "挪威",
        ],
        id: "47"
        , key: "279"
    },
    {
        string: [
            "大洋洲",
            "诺福克岛",
        ],
        id: "6723"
        , key: "411"
    }
    ,
    {
        string: [
            "欧洲",
            "葡萄牙",
        ],
        id: "351"
        , key: "285"
    },
    {
        string: [
            "非洲",
            "普林西比",
        ],
        id: "00239"
        , key: "362"
    },

    {
        string: [
            "亚洲",
            "日本",
        ],
        id: "81"
        , key: "223"
    },
    {
        string: [
            "欧洲",
            "瑞典",
        ],
        id: "46"
        , key: "278"
    },
    {
        string: [
            "欧洲",
            "瑞士",
        ],
        id: "41"
        , key: "275"
    }
    ,
    {
        string: [
            "南美洲",
            "萨尔瓦多",
        ],
        id: "503"
        , key: "320"
    },
    {
        string: [
            "非洲",
            "塞拉利昂",
        ],
        id: "232"
        , key: "354"
    },
    {
        string: [
            "非洲",
            "塞内加尔",
        ],
        id: "221"
        , key: "343"
    },
    {
        string: [
            "欧洲",
            "塞浦路斯",
        ],
        id: "357"
        , key: "291"
    },
    {
        string: [
            "非洲",
            "塞舌尔",
        ],
        id: "248"
        , key: "370"
    },
    {
        string: [
            "亚洲",
            "沙特阿拉伯",
        ],
        id: "966"
        , key: "248"
    },
    {
        string: [
            "南美洲",
            "圣彼埃尔",
        ],
        id: "508"
        , key: "325"
    },
    {
        string: [
            "大洋洲",
            "圣诞岛",
        ],
        id: "619164"
        , key: "412"
    },
    {
        string: [
            "非洲",
            "圣多美",
        ],
        id: "239"
        , key: "361"
    },
    {
        string: [
            "非洲",
            "圣赫勒拿",
        ],
        id: "290"
        , key: "391"
    },
    {
        string: [
            "北美洲",
            "圣卢西亚",
        ],
        id: "1758"
        , key: "424"
    },
    {
        string: [
            "欧洲",
            "圣马力诺",
        ],
        id: "378"
        , key: "281"
    },
    {
        string: [
            "亚洲",
            "斯里兰卡",
        ],
        id: "94"
        , key: "232"
    },
    {
        string: [
            "欧洲",
            "斯洛伐克",
        ],
        id: "421"
        , key: "307"
    },
    {
        string: [
            "欧洲",
            "斯洛文尼亚",
        ],
        id: "386"
        , key: "302"
    },
    {
        string: [
            "非洲",
            "斯威士兰",
        ],
        id: "268"
        , key: "389"
    },
    {
        string: [
            "非洲",
            "苏丹",
        ],
        id: "249"
        , key: "371"
    },
    {
        string: [
            "南美洲",
            "苏里南",
        ],
        id: "597"
        , key: "334"
    },
    {
        string: [
            "大洋洲",
            "所罗门群岛",
        ],
        id: "677"
        , key: "401"
    },
    {
        string: [
            "非洲",
            "索马里",
        ],
        id: "252"
        , key: "374"
    }
    ,
    {
        string: [
            "亚洲",
            "塔吉克斯坦",
        ],
        id: "992"
        , key: "225"
    },

    {
        string: [
            "亚洲",
            "泰国",
        ],
        id: "66"
        , key: "222"
    },
    {
        string: [
            "非洲",
            "坦桑尼亚",
        ],
        id: "255"
        , key: "377"
    },
    {
        string: [
            "大洋洲",
            "汤加",
        ],
        id: "676"
        , key: "400"
    },
    {
        string: [
            "非洲",
            "突尼斯",
        ],
        id: "216"
        , key: "340"
    },
    {
        string: [
            "大洋洲",
            "图瓦卢",
        ],
        id: "688"
        , key: "409"
    },
    {
        string: [
            "亚洲",
            "土耳其",
        ],
        id: "90"
        , key: "228"
    },
    {
        string: [
            "亚洲",
            "土库曼斯坦",
        ],
        id: "993"
        , key: "259"
    }
    ,
    {
        string: [
            "大洋洲",
            "瓦努阿图",
        ],
        id: "678"
        , key: "402"
    },
    {
        string: [
            "南美洲",
            "危地马拉",
        ],
        id: "502"
        , key: "319"
    },
    {
        string: [
            "北美洲",
            "威克岛",
        ],
        id: "808"
        , key: "419"
    },
    {
        string: [
            "北美洲",
            "维尔京群岛",
        ],
        id: "1284"
        , key: "420"
    },
    {
        string: [
            "南美洲",
            "委内瑞拉",
        ],
        id: "58"
        , key: "316"
    },
    {
        string: [
            "亚洲",
            "文莱",
        ],
        id: "673"
        , key: "237"
    },
    {
        string: [
            "非洲",
            "乌干达",
        ],
        id: "256"
        , key: "378"
    },
    {
        string: [
            "欧洲",
            "乌克兰",
        ],
        id: "380"
        , key: "299"
    },
    {
        string: [
            "南美洲",
            "乌拉圭",
        ],
        id: "598"
        , key: "335"
    },
    {
        string: [
            "亚洲",
            "乌兹别克斯坦",
        ],
        id: "998"
        , key: "263"
    }
    ,
    {
        string: [
            "欧洲",
            "西班牙",
        ],
        id: "34"
        , key: "272"
    },
    {
        string: [
            "大洋洲",
            "西萨摩亚",
        ],
        id: "685"
        , key: "407"
    },
    {
        string: [
            "欧洲",
            "希腊",
        ],
        id: "30"
        , key: "269"
    },
    {
        string: [
            "北美洲",
            "夏威夷",
        ],
        id: "00 1"
        , key: "415"
    },

    {
        string: [
            "亚洲",
            "新加坡",
        ],
        id: "65"
        , key: "221"
    },
    {
        string: [
            "大洋洲",
            "新西兰",
        ],
        id: "64"
        , key: "397"
    },
    {
        string: [
            "欧洲",
            "匈牙利",
        ],
        id: "36"
        , key: "273"
    },
    {
        string: [
            "欧洲",
            "匈牙利",
        ],
        id: "336"
        , key: "282"
    },
    {
        string: [
            "亚洲",
            "叙利亚",
        ],
        id: "963"
        , key: "245"
    }
    ,
    {
        string: [
            "北美洲",
            "牙买加",
        ],
        id: "1876"
        , key: "426"
    },
    {
        string: [
            "亚洲",
            "亚美尼亚",
        ],
        id: "374"
        , key: "235"
    },
    {
        string: [
            "亚洲",
            "也门",
        ],
        id: "967"
        , key: "249"
    },
    {
        string: [
            "亚洲",
            "伊拉克",
        ],
        id: "964"
        , key: "246"
    },
    {
        string: [
            "亚洲",
            "伊朗",
        ],
        id: "98"
        , key: "234"
    },
    {
        string: [
            "亚洲",
            "以色列",
        ],
        id: "972"
        , key: "253"
    },
    {
        string: [
            "欧洲",
            "意大利",
        ],
        id: "39"
        , key: "266"
    },
    {
        string: [
            "亚洲",
            "印度",
        ],
        id: "91"
        , key: "229"
    },
    {
        string: [
            "亚洲",
            "印度尼西亚",
        ],
        id: "62"
        , key: "219"
    },
    {
        string: [
            "欧洲",
            "英国",
        ],
        id: "44"
        , key: "264"
    },
    {
        string: [
            "亚洲",
            "约旦",
        ],
        id: "962"
        , key: "244"
    },
    {
        string: [
            "亚洲",
            "越南",
        ],
        id: "84"
        , key: "227"
    }
    ,
    {
        string: [
            "非洲",
            "赞比亚",
        ],
        id: "260"
        , key: "381"
    },
    {
        string: [
            "非洲",
            "扎伊尔",
        ],
        id: "243"
        , key: "366"
    },
    {
        string: [
            "非洲",
            "乍得",
        ],
        id: "235"
        , key: "357"
    },
    {
        string: [
            "欧洲",
            "直布罗陀",
        ],
        id: "350"
        , key: "284"
    },
    {
        string: [
            "南美洲",
            "智利",
        ],
        id: "56"
        , key: "314"
    },
    {
        string: [
            "非洲",
            "中非",
        ],
        id: "236"
        , key: "358"
    },


    {
        string: [
            "北美洲",
            "中途岛",
        ],
        id: "1808"
        , key: "418"
    }
];


function sortChinese(arr:any, dataLeven:any) { // 参数：arr 排序的数组; dataLeven 数组内的需要比较的元素属性
    /* 获取数组元素内需要比较的值 */
    function getValue(option:any) { // 参数： option 数组元素
        if (!dataLeven) return option
        let data = option
        dataLeven.split('.').filter(function (item:any) {
            data = data[item]
        })
        return data + ''
    }
    arr.sort(function (item1:any, item2:any) {
        return getValue(item1).localeCompare(getValue(item2), 'zh-CN');
    })
}

sortChinese(countryCodeTemp, 'string');
const countryCode : {label: string, value: string}[] = countryCodeTemp.map(item =>{
    // item['value'] = item.string.toString();
    // item['label']= "+"+item.key +" "+ item['value'] ;
    return {
        value: item.id,
        label: "+"+item.id +" "+ item.string[item.string.length-1].toString()
    };
});

export default countryCode;